README.org
# Created 2023-03-01 Mi 21:17
#+options: toc:2
#+title: Ansible Pot
#+author: Daniel Ziltener
I am a role to manage your Pot jails on FreeBSD. My source is located in the [[https://github.com/zilti/ansible-pot/blob/master/pot.org][pot.org]] file.

* Requirements

None.

* Role Variables

** Pot Server

#+name: server-default-vars
| Variable            | Type | Choices | Required? | Default          | Info                      |
|---------------------+------+---------+-----------+------------------+---------------------------|
| enabled             | bool |         |           | False            | Triggers ~pot init~       |
| vnet_enabled        | bool |         |           | False            | Triggers ~pot vnet-start~ |
| zfs_root            | str  |         |           | 'tank/pot'       | Is written to =pot.conf=  |
| fs_root             | str  |         |           | '/opt/pot'       | Is written to =pot.conf=  |
| cache               | str  |         |           | '/var/cache/pot' | Is written to =pot.conf=  |
| tmp                 | str  |         |           | '/tmp'           | Is written to =pot.conf=  |
| mktemp_suffix       | str  |         |           | '.XXXXXXXX'      | Is written to =pot.conf=  |
| hostname_max_length | int  |         |           | 64               | Is written to =pot.conf=  |
| network             | str  |         |           | '10.192.0.0/10'  | Is written to =pot.conf=  |
| netmask             | str  |         |           | '255.192.0.0'    | Is written to =pot.conf=  |
| gateway             | str  |         |           | '10.192.0.1'     | Is written to =pot.conf=  |
| extif               | str  |         |           | 'em0'            | Is written to =pot.conf=  |

#+begin_src yaml
  ---
  pot:
    enabled: False
    vnet_enabled: False
    zfs_root: 'tank/pot'
    fs_root: '/opt/pot'
    cache: '/var/cache/pot'
    tmp: '/tmp'
    mktemp_suffix: '.XXXXXXXX'
    hostname_max_length: 64
    network: '10.192.0.0/10'
    netmask: '255.192.0.0'
    gateway: '10.192.0.1'
    extif: 'em0'
#+end_src

** Collected Variables

#+name: pot-intel
| Variable         | Default | Info                                                                        |
|------------------+---------+-----------------------------------------------------------------------------|
| initialized      |         | If ~pot init~ has been run already.                                         |
| vnet_initialized |         | If ~pot vnet-start~ has been run already.                                   |
| version          |         | The pot version.                                                            |
| fscomps          | []      |                                                                             |
| bridges          | []      |                                                                             |
| bases            | []      |                                                                             |
| jails            | {}      | A JSON list of the data returned by ~pot info -p~; keys are the jail names. |

#+begin_src yaml
  ---
  potintel:
    initialized: '{{ ansible_local.pot.initialized|default("") }}'
    vnet_initialized: '{{ ansible_local.pot.vnet_initialized|default("") }}'
    version: '{{ ansible_local.pot.version|default("") }}'
    fscomps: '{{ ansible_local.pot.fscomps|default("[]") }}'
    bridges: '{{ ansible_local.pot.bridges|default("[]") }}'
    bases: '{{ ansible_local.pot.bases|default("[]") }}'
    jails: '{{ ansible_local.pot.jails|default("{}") }}'
#+end_src

** Pot Configuration Template

#+begin_src jinja2
  # {{ ansible_managed }}
  # pot configuration file

  # All datasets related to pot use the some zfs dataset as parent
  # With this variable, you can choose which dataset has to be used
  POT_ZFS_ROOT={{ pot.zfs_root|default("zroot/pot") }}

  # It is also important to know where the root dataset is mounted
  POT_FS_ROOT={{ pot.fs_root|default("/opt/pot") }}

  # This is the cache used to import/export pots
  POT_CACHE={{ pot.cache|default("/var/cache/pot") }}

  # This is where pot is going to store temporary files
  POT_TMP={{ pot.tmp|default("/tmp") }}

  # This is the suffix added to temporary files created using mktemp,
  # X is a placeholder for a random character, see mktemp(1)
  POT_MKTEMP_SUFFIX={{ pot.mktemp_suffix|default(".XXXXXXXX") }}

  # Define the max length of the hostname inside the pot
  POT_HOSTNAME_MAX_LENGTH={{ pot.hostname_max_length|default(64) }}

  # Internal Virtual Network configuration

  # IPv4 Internal Virtual network
  POT_NETWORK={{ pot.network|default("10.192.0.0/10") }}

  # Internal Virtual Network netmask
  POT_NETMASK={{ pot.netmask|default("255.192.0.0") }}

  # The default gateway of the Internal Virtual Network
  POT_GATEWAY={{ pot.gateway|default("10.192.0.1") }}

  # The name of the network physical interface, to be used as default gateway
  POT_EXTIF={{ pot.extif|default("em0") }}

  {% if "extra_extif" in pot %}
  # The list of extra network interface, to make other network segments accessible
  POT_EXTRA_EXTIF={%- for item in pot.extra_extif %}{{ item.name }} {%- endfor %}
  # for each extra interface, a variable is used to sepcify its network segment
  {% for item in pot.extra_extif %}
  POT_NETWORK_{{ item.name }}={{ item.netmask }}
  {% endfor %}
  {% else %}
  # POT_EXTRA_EXTIF=expl0
  # POT_NETWORK_expl0=
  {% endif %}

  # DNS on the Internal Virtual Network

  # name of the pot running the DNS
  POT_DNS_NAME={{ pot.dns_name|default() }}

  # IP of the DNS
  POT_DNS_IP={{ pot.dns_ip|default() }}

  # VPN support

  # name of the tunnel network interface
  POT_VPN_EXTIF={{ pot.vpn_extif|default() }}

  {% if "vpn_networks" in pot %}
  POT_VPN_NETWORKS={%- for item in pot.vpn_networks %}{{ item }} {%- endfor %}
  {% else %}
  # POT_VPN_NETWORKS=
  {% endif %}

  # EOF
#+end_src


* Plugins

