zilti/pot/README.md

# Table of Contents

1.  [Requirements](#orga2a93a0)
2.  [Role Variables](#org50b6af0)
    1.  [Pot Server](#org10c0afd)
    2.  [Collected Variables](#org466f02a)
    3.  [Pot Configuration Template](#org9b8251c)
3.  [Plugins](#orgcda5a94)
    1.  [Bridges Module](#orga73a0b9)
    2.  [FS Components Module](#org692d971)
    3.  [Bases Module](#orgd78002c)
    4.  [Jails Module](#org6a51e8d)
    5.  [Inventory](#org0ecc845)
    6.  [Pot Connection](#org071f6b5)
    7.  [Lookup Plugin](#org2b02075)
4.  [Dependencies](#orgd149cdf)
5.  [Example Playbook](#org93776f5)
6.  [License](#org28db34f)
7.  [Author Information](#org6d6357e)
8.  [Ansible Galaxy Metadata](#orgd45118d)

I am a role to manage your Pot jails on FreeBSD. My source is located in the [pot.org](https://github.com/zilti/ansible-pot/blob/master/pot.org) file.


<a id="orga2a93a0"></a>

# Requirements

None.


<a id="org50b6af0"></a>

# Role Variables


<a id="org10c0afd"></a>

## Pot Server

<table id="org72feb7e" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Choices</th>
<th scope="col" class="org-left">Required?</th>
<th scope="col" class="org-left">Default</th>
<th scope="col" class="org-left">Info</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">enabled</td>
<td class="org-left">bool</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">False</td>
<td class="org-left">Triggers <code>pot init</code></td>
</tr>


<tr>
<td class="org-left">vnet<sub>enabled</sub></td>
<td class="org-left">bool</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">False</td>
<td class="org-left">Triggers <code>pot vnet-start</code></td>
</tr>


<tr>
<td class="org-left">zfs<sub>root</sub></td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">'tank/pot'</td>
<td class="org-left">Is written to <code>pot.conf</code></td>
</tr>


<tr>
<td class="org-left">fs<sub>root</sub></td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">'/opt/pot'</td>
<td class="org-left">Is written to <code>pot.conf</code></td>
</tr>


<tr>
<td class="org-left">cache</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">'/var/cache/pot'</td>
<td class="org-left">Is written to <code>pot.conf</code></td>
</tr>


<tr>
<td class="org-left">tmp</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">'/tmp'</td>
<td class="org-left">Is written to <code>pot.conf</code></td>
</tr>


<tr>
<td class="org-left">mktemp<sub>suffix</sub></td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">'.XXXXXXXX'</td>
<td class="org-left">Is written to <code>pot.conf</code></td>
</tr>


<tr>
<td class="org-left">hostname<sub>max</sub><sub>length</sub></td>
<td class="org-left">int</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">64</td>
<td class="org-left">Is written to <code>pot.conf</code></td>
</tr>


<tr>
<td class="org-left">network</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">'10.192.0.0/10'</td>
<td class="org-left">Is written to <code>pot.conf</code></td>
</tr>


<tr>
<td class="org-left">netmask</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">'255.192.0.0'</td>
<td class="org-left">Is written to <code>pot.conf</code></td>
</tr>


<tr>
<td class="org-left">gateway</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">'10.192.0.1'</td>
<td class="org-left">Is written to <code>pot.conf</code></td>
</tr>


<tr>
<td class="org-left">extif</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">'em0'</td>
<td class="org-left">Is written to <code>pot.conf</code></td>
</tr>
</tbody>
</table>

    ---
    pot:
      enabled: False
      vnet_enabled: False
      zfs_root: 'tank/pot'
      fs_root: '/opt/pot'
      cache: '/var/cache/pot'
      tmp: '/tmp'
      mktemp_suffix: '.XXXXXXXX'
      hostname_max_length: 64
      network: '10.192.0.0/10'
      netmask: '255.192.0.0'
      gateway: '10.192.0.1'
      extif: 'em0'


<a id="org466f02a"></a>

## Collected Variables

<table id="org85e7256" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Default</th>
<th scope="col" class="org-left">Info</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">initialized</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">If <code>pot init</code> has been run already.</td>
</tr>


<tr>
<td class="org-left">vnet<sub>initialized</sub></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">If <code>pot vnet-start</code> has been run already.</td>
</tr>


<tr>
<td class="org-left">version</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">The pot version.</td>
</tr>


<tr>
<td class="org-left">fscomps</td>
<td class="org-left">[]</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">bridges</td>
<td class="org-left">[]</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">bases</td>
<td class="org-left">[]</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">jails</td>
<td class="org-left">{}</td>
<td class="org-left">A JSON list of the data returned by <code>pot info -p</code>; keys are the jail names.</td>
</tr>
</tbody>
</table>

    ---
    potintel:
      initialized: '{{ ansible_local.pot.initialized|default("") }}'
      vnet_initialized: '{{ ansible_local.pot.vnet_initialized|default("") }}'
      version: '{{ ansible_local.pot.version|default("") }}'
      fscomps: '{{ ansible_local.pot.fscomps|default("[]") }}'
      bridges: '{{ ansible_local.pot.bridges|default("[]") }}'
      bases: '{{ ansible_local.pot.bases|default("[]") }}'
      jails: '{{ ansible_local.pot.jails|default("{}") }}'


<a id="org9b8251c"></a>

## Pot Configuration Template

    # {{ ansible_managed }}
    # pot configuration file
    
    # All datasets related to pot use the some zfs dataset as parent
    # With this variable, you can choose which dataset has to be used
    POT_ZFS_ROOT={{ pot.zfs_root|default("zroot/pot") }}
    
    # It is also important to know where the root dataset is mounted
    POT_FS_ROOT={{ pot.fs_root|default("/opt/pot") }}
    
    # This is the cache used to import/export pots
    POT_CACHE={{ pot.cache|default("/var/cache/pot") }}
    
    # This is where pot is going to store temporary files
    POT_TMP={{ pot.tmp|default("/tmp") }}
    
    # This is the suffix added to temporary files created using mktemp,
    # X is a placeholder for a random character, see mktemp(1)
    POT_MKTEMP_SUFFIX={{ pot.mktemp_suffix|default(".XXXXXXXX") }}
    
    # Define the max length of the hostname inside the pot
    POT_HOSTNAME_MAX_LENGTH={{ pot.hostname_max_length|default(64) }}
    
    # Internal Virtual Network configuration
    
    # IPv4 Internal Virtual network
    POT_NETWORK={{ pot.network|default("10.192.0.0/10") }}
    
    # Internal Virtual Network netmask
    POT_NETMASK={{ pot.netmask|default("255.192.0.0") }}
    
    # The default gateway of the Internal Virtual Network
    POT_GATEWAY={{ pot.gateway|default("10.192.0.1") }}
    
    # The name of the network physical interface, to be used as default gateway
    POT_EXTIF={{ pot.extif|default("em0") }}
    
    {% if "extra_extif" in pot %}
    # The list of extra network interface, to make other network segments accessible
    POT_EXTRA_EXTIF={%- for item in pot.extra_extif %}{{ item.name }} {%- endfor %}
    # for each extra interface, a variable is used to sepcify its network segment
    {% for item in pot.extra_extif %}
    POT_NETWORK_{{ item.name }}={{ item.netmask }}
    {% endfor %}
    {% else %}
    # POT_EXTRA_EXTIF=expl0
    # POT_NETWORK_expl0=
    {% endif %}
    
    # DNS on the Internal Virtual Network
    
    # name of the pot running the DNS
    POT_DNS_NAME={{ pot.dns_name|default() }}
    
    # IP of the DNS
    POT_DNS_IP={{ pot.dns_ip|default() }}
    
    # VPN support
    
    # name of the tunnel network interface
    POT_VPN_EXTIF={{ pot.vpn_extif|default() }}
    
    {% if "vpn_networks" in pot %}
    POT_VPN_NETWORKS={%- for item in pot.vpn_networks %}{{ item }} {%- endfor %}
    {% else %}
    # POT_VPN_NETWORKS=
    {% endif %}
