README.org
** Bridges Module

Pot bridges created with ~pot create-private-bridge~.

#+name: bridge-vars
| Variable | Type | Choices             | Required? | Default   | Info                     |
|----------+------+---------------------+-----------+-----------+--------------------------|
| name     | str  |                     | #t        | None      | The bridge name          |
| size     | int  |                     | #f        | None      | expected number of hosts |
| state    | str  | 'present', 'absent' | #f        | 'present' |                          |
| ignore   | bool |                     | #f        | False     |                          |

*** Examples

#+name: bridge-examples
#+begin_src yaml
  - name: Create private bridge
    pot_bridge:
      name: mybridge
      size: 5
  - name: Check if creation was successful
    shell:
      cmd: if [ -f /opt/pot/bridges/mybridge ]; then exit 0; else exit 1; fi
    register: bridgetest
  - name: Assert test result
    assert:
      that:
        - bridgetest.rc == 0
#+end_src

** FS Components Module

The ones created with ~pot create-fscomp~.

#+name: fscomp-vars
| Variable | Type | Choices             | Required? | Default   | Info              |
|----------+------+---------------------+-----------+-----------+-------------------|
| name     | str  |                     | #t        | None      | The fscomp name   |
| state    | str  | 'present', 'absent' | #f        | 'present' |                   |
| ignore   | bool |                     | #f        | False     | Ignore this task? |

*** Examples

** Bases Module

The ones created with ~pot create-base~.

#+name: base-vars
| Variable | Type | Choices             | Required? | Default   | Info                       |
|----------+------+---------------------+-----------+-----------+----------------------------|
| name     | str  |                     | #t        | None      | The base name              |
| release  | str  |                     | #t        | None      | The FreeBSD release to use |
| state    | str  | 'present', 'absent' | #f        | 'present' |                            |
| ignore   | bool |                     | #f        | False     | Ignore this task?          |

*** Examples

