README.org
** Jails Module

For each jail, you can supply a number of arguments.

#+name: jail-vars
| Variable      | Type | Choices                                                | Required? | Default             | Info              |
|---------------+------+--------------------------------------------------------+-----------+---------------------+-------------------|
| name          | str  |                                                        | #t        | None                | The jail name     |
| state         | str  | 'present', 'absent', 'started', 'stopped', 'restarted' | #f        | 'present'           |                   |
| ignore        | bool |                                                        | #f        | False               | Ignore this task? |
| ip            | list | str                                                    | #f        | []                  | Defaults to auto  |
| network_stack | str  | 'ipv4', 'ipv6', 'dual'                                 | #f        | 'dual'              |                   |
| network_type  | str  | 'inherit', 'alias', 'public-bridge', 'private-bridge'  | #f        | 'inherit'           |                   |
| bridge_name   | str  |                                                        | #f        | None                |                   |
| base          | str  |                                                        | #t        | None                |                   |
| pot           | str  |                                                        | #f        | None                |                   |
| type          | str  | 'single', 'multi'                                      | #f        | 'multi'             |                   |
| level         | int  |                                                        | #f        | None                |                   |
| flavour       | list | str                                                    | #f        | ['ansible-managed'] |                   |
| mounts        | list | dict                                                   | #f        | []                  | Things to mount   |
| ports         | list | dict                                                   | #f        | []                  | Ports to map      |
| attributes    | dict |                                                        | #f        | {}                  | Attributes        |

*Options for mounts:*

#+name: jail-mount-vars
| Variable | Type | Choices    | Required? | Default | Info                                               |
|----------+------+------------+-----------+---------+----------------------------------------------------|
| target   | path |            | #t        | None    | Mount point                                        |
| dir      | path |            | #f        | None    | Directory on the host to mount                     |
| fscomp   | str  |            | #f        | None    | fscomp to mount                                    |
| dataset  | str  |            | #f        | None    | ZFS dataset to mount                               |
| direct   | bool |            | #f        | False   | change the ZFS mount point instead of using nullfs |
| mode     | str  | 'ro', 'rw' | #f        | 'rw'    | Mount as read-only or read-write?                  |

*Options for ports:*

| Variable | Type | Choices      | Required? | Default | Info                             |
|----------+------+--------------+-----------+---------+----------------------------------|
| protocol | str  | 'tcp', 'udp' | #f        | 'tcp'   |                                  |
| port     | int  |              | #t        | None    | The port to export               |
| pot_port | int  |              | #f        | None    | dynamically allocated by default |

*** Examples

*** =ansible-managed= Flavour

A freshly created pot is somewhat useless if you want to manage it with Ansible, because there is no Python installation, and no sudo.

#+begin_src shell
  pkg install -y python3 sudo
  pkg clean -ayq
#+end_src

#+begin_src yaml
  - name: Install ansible-managed Flavour
    copy:
      dest: '/usr/local/etc/pot/flavours/ansible-managed.sh'
      src: 'ansible-managed.sh'
      mode: '0755'
    become: yes
#+end_src

** Inventory
** Pot Connection

This collection also provides a connection plugin to execute commands inside a Pot. Two variants are provided: one for local pots, and one for remote pots.

*** Local Pots

#+name: local-potconn-vars
| Variable     | Type | Choices | Required? | Default            | Info                           |
|--------------+------+---------+-----------+--------------------+--------------------------------|
| ansible_host | str  |         | #f        | inventory_hostname | Name of the jail               |
| ansible_user | str  |         | #f        |                    | User inside the jail to run as |

**** Examples

*** Remote Pots

Connecting to remote pots works almost like the SSH connection plugin - it is an extension of it. The difference is that you have to specify the name of the pot, and of course tell Ansible to use the =zilti.pot.pot_remote= connection plugin. Here's an example inventory file:

#+name: remotepot-inventory
#+begin_src fundamental
  [jails]
  testpot1@192.168.121.13 ansible_connection=zilti.pot.pot_remote
#+end_src

Be aware that the connection plugin will need to use a =become= plugin to copy files into and out of the pot.

** Lookup Plugin

This lookup plugin is currently in a testing phase.

* Dependencies

Needs the =community.general= collection.

