zilti/pot/README.md


### Examples


<a id="org6a51e8d"></a>

## Jails Module

For each jail, you can supply a number of arguments.

<table id="org1611286" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Choices</th>
<th scope="col" class="org-left">Required?</th>
<th scope="col" class="org-left">Default</th>
<th scope="col" class="org-left">Info</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">name</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#t</td>
<td class="org-left">None</td>
<td class="org-left">The jail name</td>
</tr>


<tr>
<td class="org-left">state</td>
<td class="org-left">str</td>
<td class="org-left">'present', 'absent', 'started', 'stopped', 'restarted'</td>
<td class="org-left">#f</td>
<td class="org-left">'present'</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">ignore</td>
<td class="org-left">bool</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#f</td>
<td class="org-left">False</td>
<td class="org-left">Ignore this task?</td>
</tr>


<tr>
<td class="org-left">ip</td>
<td class="org-left">list</td>
<td class="org-left">str</td>
<td class="org-left">#f</td>
<td class="org-left">[]</td>
<td class="org-left">Defaults to auto</td>
</tr>


<tr>
<td class="org-left">network<sub>stack</sub></td>
<td class="org-left">str</td>
<td class="org-left">'ipv4', 'ipv6', 'dual'</td>
<td class="org-left">#f</td>
<td class="org-left">'dual'</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">network<sub>type</sub></td>
<td class="org-left">str</td>
<td class="org-left">'inherit', 'alias', 'public-bridge', 'private-bridge'</td>
<td class="org-left">#f</td>
<td class="org-left">'inherit'</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">bridge<sub>name</sub></td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#f</td>
<td class="org-left">None</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">base</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#t</td>
<td class="org-left">None</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">pot</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#f</td>
<td class="org-left">None</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">type</td>
<td class="org-left">str</td>
<td class="org-left">'single', 'multi'</td>
<td class="org-left">#f</td>
<td class="org-left">'multi'</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">level</td>
<td class="org-left">int</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#f</td>
<td class="org-left">None</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">flavour</td>
<td class="org-left">list</td>
<td class="org-left">str</td>
<td class="org-left">#f</td>
<td class="org-left">['ansible-managed']</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">mounts</td>
<td class="org-left">list</td>
<td class="org-left">dict</td>
<td class="org-left">#f</td>
<td class="org-left">[]</td>
<td class="org-left">Things to mount</td>
</tr>


<tr>
<td class="org-left">ports</td>
<td class="org-left">list</td>
<td class="org-left">dict</td>
<td class="org-left">#f</td>
<td class="org-left">[]</td>
<td class="org-left">Ports to map</td>
</tr>


<tr>
<td class="org-left">attributes</td>
<td class="org-left">dict</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#f</td>
<td class="org-left">{}</td>
<td class="org-left">Attributes</td>
</tr>
</tbody>
</table>

**Options for mounts:**

<table id="org67abd92" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Choices</th>
<th scope="col" class="org-left">Required?</th>
<th scope="col" class="org-left">Default</th>
<th scope="col" class="org-left">Info</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">target</td>
<td class="org-left">path</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#t</td>
<td class="org-left">None</td>
<td class="org-left">Mount point</td>
</tr>


<tr>
<td class="org-left">dir</td>
<td class="org-left">path</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#f</td>
<td class="org-left">None</td>
<td class="org-left">Directory on the host to mount</td>
</tr>


<tr>
<td class="org-left">fscomp</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#f</td>
<td class="org-left">None</td>
<td class="org-left">fscomp to mount</td>
</tr>


<tr>
<td class="org-left">dataset</td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#f</td>
<td class="org-left">None</td>
<td class="org-left">ZFS dataset to mount</td>
</tr>


<tr>
<td class="org-left">direct</td>
<td class="org-left">bool</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#f</td>
<td class="org-left">False</td>
<td class="org-left">change the ZFS mount point instead of using nullfs</td>
</tr>


<tr>
<td class="org-left">mode</td>
<td class="org-left">str</td>
<td class="org-left">'ro', 'rw'</td>
<td class="org-left">#f</td>
<td class="org-left">'rw'</td>
<td class="org-left">Mount as read-only or read-write?</td>
</tr>
</tbody>
</table>

**Options for ports:**

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Choices</th>
<th scope="col" class="org-left">Required?</th>
<th scope="col" class="org-left">Default</th>
<th scope="col" class="org-left">Info</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">protocol</td>
<td class="org-left">str</td>
<td class="org-left">'tcp', 'udp'</td>
<td class="org-left">#f</td>
<td class="org-left">'tcp'</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">port</td>
<td class="org-left">int</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#t</td>
<td class="org-left">None</td>
<td class="org-left">The port to export</td>
</tr>


<tr>
<td class="org-left">pot<sub>port</sub></td>
<td class="org-left">int</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#f</td>
<td class="org-left">None</td>
<td class="org-left">dynamically allocated by default</td>
</tr>
</tbody>
</table>


### Examples


### `ansible-managed` Flavour

A freshly created pot is somewhat useless if you want to manage it with Ansible, because there is no Python installation, and no sudo.

    pkg install -y python3 sudo
    pkg clean -ayq

    - name: Install ansible-managed Flavour
      copy:
        dest: '/usr/local/etc/pot/flavours/ansible-managed.sh'
        src: 'ansible-managed.sh'
        mode: '0755'
      become: yes


<a id="org0ecc845"></a>

## Inventory


<a id="org071f6b5"></a>

## Pot Connection

This collection also provides a connection plugin to execute commands inside a Pot. Two variants are provided: one for local pots, and one for remote pots.


### Local Pots

<table id="org7a90ca5" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Choices</th>
<th scope="col" class="org-left">Required?</th>
<th scope="col" class="org-left">Default</th>
<th scope="col" class="org-left">Info</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">ansible<sub>host</sub></td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#f</td>
<td class="org-left">inventory<sub>hostname</sub></td>
<td class="org-left">Name of the jail</td>
</tr>


<tr>
<td class="org-left">ansible<sub>user</sub></td>
<td class="org-left">str</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">#f</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">User inside the jail to run as</td>
</tr>
</tbody>
</table>

1.  Examples


### Remote Pots

Connecting to remote pots works almost like the SSH connection plugin - it is an extension of it. The difference is that you have to specify the name of the pot, and of course tell Ansible to use the `zilti.pot.pot_remote` connection plugin. Here's an example inventory file:

    [jails]
    testpot1@192.168.121.13 ansible_connection=zilti.pot.pot_remote

Be aware that the connection plugin will need to use a `become` plugin to copy files into and out of the pot.


<a id="org2b02075"></a>

## Lookup Plugin

This lookup plugin is currently in a testing phase.


<a id="orgd149cdf"></a>

# Dependencies

Needs the `community.general` collection.
