README.org
* Example Playbook

#+begin_src yaml
  - hosts: all
    become: yes
    remote_user: root
    roles:
    - role: zilti.pot.pot
      vars:
        pot:
  	enabled: true
  	vnet_enabled: true
  	zfs_root: tank/pot
  	extif: vtnet0
    tasks:
    - zilti.pot.pot_base:
        name: 13.1
        release: 13.1

    - zilti.pot.pot_fscomp:
        name: testfs

    - zilti.pot.pot_jail:
        name: testpot1
        base: 13.1
        type: single
        state: started
        mounts:
        - target: /opt
  	fscomp: testfs
#+end_src

* License

GPL3.0

* Author Information

Daniel Ziltener, Code & Magic UG

* Ansible Galaxy Metadata

#+begin_src yaml
  requires_ansible: ">=2.9"
#+end_src

#+begin_src yaml
  namespace: zilti
  name: pot
  version: 0.5.27

  authors:
    - Daniel Ziltener <dziltener@lyrion.ch>

  dependencies:
    community.general: "*"

  tags:
    - freebsd
    - jails
    - pot

  readme: README.md
  license: GPL-3.0-or-later
  description: Roles and modules for installing and using Pot

  repository: https://github.com/zilti/ansible-pot
  issues: https://github.com/zilti/ansible-pot/issues
  documentation: https://github.com/zilti/ansible-pot
  homepage: https://github.com/zilti/ansible-pot
#+end_src

#+begin_src yaml
  galaxy_info:
    author: Daniel Ziltener
    description: A role to manage Pot jails
    company: Code & Magic UG

    # If the issue tracker for your role is not on github, uncomment the
    # next line and provide a value
    # issue_tracker_url: http://example.com/issue/tracker

    # Choose a valid license ID from https://spdx.org - some suggested licenses:
    # - BSD-3-Clause (default)
    # - MIT
    # - GPL-2.0-or-later
    # - GPL-3.0-only
    # - Apache-2.0
    # - CC-BY-4.0
    license: GPL-3.0-or-later

    min_ansible_version: 2.9

    # If this a Container Enabled role, provide the minimum Ansible Container version.
    # min_ansible_container_version:

    #
    # Provide a list of supported platforms, and for each platform a list of versions.
    # If you don't wish to enumerate all versions for a particular platform, use 'all'.
    # To view available platforms and versions (or releases), visit:
    # https://galaxy.ansible.com/api/v1/platforms/

    platforms:
    - name: FreeBSD
      versions:
      - all

    galaxy_tags:
    - freebsd
    - jails
      # List tags for your role here, one per line. A tag is a keyword that describes
      # and categorizes the role. Users find roles by searching for tags. Be sure to
      # remove the '[]' above, if you add tags to this list.
      #
      # NOTE: A tag is limited to a single word comprised of alphanumeric characters.
      #       Maximum 20 tags per role.

  dependencies: []
    # List your role dependencies here, one per line. Be sure to remove the '[]' above,
    # if you add dependencies to this list.
#+end_src
